# Exercício - Mini Projeto de Análise de Dados

Vamos fazer um exercício completo de pandas para um miniprojeto de análise de dados.

Esse exercício vai obrigar a gente a usar boa parte dos conhecimento de pandas e até de outros módulos que já aprendemos ao longo do curso.

### O que temos?

Temos os dados de 2019 de uma empresa de prestação de serviços. 

- CadastroFuncionarios
- CadastroClientes
- BaseServiçosPrestados

Obs1: Para ler arquivos csv, temos o read_csv<br>
Obs2: Para ler arquivos xlsx (arquivos em excel normais, que não são padrão csv), temos o read_excel

### O que queremos saber/fazer?

1. Valor Total da Folha Salarial -> Qual foi o gasto total com salários de funcionários pela empresa? <br>
    Sugestão: calcule o salário total de cada funcionário, salário + benefícios + impostos, depois some todos os salários
    
    
2. Qual foi o faturamento da empresa?<br>
    Sugestão: calcule o faturamento total de cada serviço e depois some o faturamento de todos
    
    
3. Qual o % de funcionários que já fechou algum contrato?<br>
    Sugestão: na base de serviços temos o funcionário que fechou cada serviço. Mas nem todos os funcionários que a empresa tem já fecharam algum serviço.<br>
    . Na base de funcionários temos uma lista com todos os funcionários<br>
    . Queremos calcular Qtde_Funcionarios_Fecharam_Serviço / Qtde_Funcionários_Totais<br>
    . Para calcular a qtde de funcionários que fecharam algum serviço, use a base de serviços e conte quantos funcionários tem ali. Mas lembre-se, cada funcionário só pode ser contado uma única vez.<br><br>
    Dica: se você aplicar o método .unique() em uma variável que é apenas 1 coluna de um dataframe, ele vai excluir todos os valores duplicados daquela coluna.<br>
    Ex: unicos_colunaA = dataframe['colunaA'].unique() te dá como resposta uma lista com todos os itens da colunaA aparecendo uma única vez. Todos os valores repetidos da colunaA são excluidos da variável unicos_colunaA 
    
    
4. Calcule o total de contratos que cada área da empresa já fechou


5. Calcule o total de funcionários por área


6. Qual o ticket médio mensal (faturamento médio mensal) dos contratos?<br>
    Dica: .mean() calcula a média -> exemplo: media_colunaA = dataframe['colunaA'].mean()

Obs: Lembrando as opções mais usuais de encoding:<br>
encoding='latin1', encoding='ISO-8859-1', encoding='utf-8' ou então encoding='cp1252'

Observação Importante: Se o seu código der um erro na hora de importar os arquivos:<br>
- CadastroClientes.csv
- CadastroFuncionarios.csv

Use separador ";" (ponto e vírgula) para resolver

In [106]:
#!pip install openpyxl

import pandas as pd
import openpyxl

df_serviços = pd.read_excel("C:\\Users\\negri\\OneDrive\\Documentos\\GitHub\\Hashtag_AnaliseDados\\Python\\Cursos\\Curso Hashtag\\07_Pandas Exercício\\BaseServiçosPrestados.xlsx")
df_cliente = pd.read_csv('C:\\Users\\negri\\OneDrive\\Documentos\\GitHub\\Hashtag_AnaliseDados\\Python\\Cursos\\Curso Hashtag\\07_Pandas Exercício\\CadastroClientes.csv', sep=';')
df_funcionarios = pd.read_csv('C:\\Users\\negri\\OneDrive\\Documentos\\GitHub\\Hashtag_AnaliseDados\\Python\\Cursos\\Curso Hashtag\\07_Pandas Exercício\\CadastroFuncionarios.csv', sep=';')

In [107]:
df_func_ajust =  df_funcionarios.copy()

df_func_ajust['Salario Base'] = pd.to_numeric(df_func_ajust['Salario Base']).fillna(0)

df_func_ajust['Impostos'] = df_func_ajust['Impostos'].str.replace(',','.')
df_func_ajust['Beneficios'] = df_func_ajust['Beneficios'].str.replace(',','.')

df_func_ajust['Impostos'] = pd.to_numeric(df_func_ajust['Impostos'], errors='coerce').fillna(0)
df_func_ajust['Beneficios'] = pd.to_numeric(df_func_ajust['Beneficios'], errors='coerce').fillna(0)

#df_func_ajust[['Nome Completo','Salario Base','Impostos','Beneficios']]
#df_func_ajust.info()

In [57]:
#display(df_func_ajust)

In [58]:
#display(df_funcionarios)

In [64]:
df_func_ajust['Folha Salarial'] = df_func_ajust['Salario Base'] + df_func_ajust['Impostos'] + df_func_ajust['Beneficios']
#display(df_func_ajust)

In [90]:
resposta1 = df_func_ajust[['Nome Completo','Salario Base','Impostos','Beneficios', 'Folha Salarial']]
resposta1

,Nome Completo,Salario Base,Impostos,Beneficios,Folha Salarial
0,Gabriel Mesquita,21910,10955.0,4382.0,37247.0
1,João Haddad,5404,2702.0,1080.8,9186.8
2,Amanda Marques Ribeiro,16066,8033.0,3213.2,27312.2
3,Guilherme Nunez,21305,10652.5,4261.0,36218.5
4,Adelino Gomes,5098,2549.0,1019.6,8666.6
...,...,...,...,...,...
109,Renan Scharnhorst Ott,10793,5396.5,2158.6,18348.1
110,Lucas Brum Pereira,4048,2024.0,809.6,6881.6
111,Caio Stellet,24596,12298.0,4919.2,41813.2
112,Fernanda Rocha,5078,2539.0,1015.6,8632.6
113,Eduardo Brum,15939,7969.5,3187.8,27096.3

In [91]:
resposta1_5 = df_func_ajust['Folha Salarial'].sum()
print(f'Custo Total da Folha Salarial dos Funcionários: R${resposta1_5:,.2f}')

Custo Total da Folha Salarial dos Funcionários: R$2,614,343.30

In [76]:
display(df_serviços)

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses)
0,OS0001,67,1,14
1,OS0002,17,2,12
2,OS0003,116,4,14
3,OS0004,37,5,8
4,OS0005,130,6,8
...,...,...,...,...
232,OS0233,111,315,4
233,OS0234,124,316,8
234,OS0235,72,317,6
235,OS0236,90,319,14
236,OS0237,22,320,12

In [75]:
display(df_cliente)

     ID Cliente             Cliente  Valor Contrato Mensal
0             1  Teixeira Gonçalves                    540
1             2        Souza Santos                   1260
2             3        Emídio Alves                   3195
3             4        Santos Costa                   2520
4             5         Do Monteiro                   3510
..          ...                 ...                    ...
315         316        Manoel Costa                   3690
316         317       Gomes Machado                   2385
317         318    Alkindar Cardozo                   3510
318         319     Pereira Fazenda                   4185
319         320   Americo Damasceno                   2430

[320 rows x 3 columns]

In [82]:
df_empresa = df_serviços.merge(df_cliente, how='inner', left_on='ID Cliente', right_on='ID Cliente')
df_empresa['Faturamento Servico'] = df_empresa['Tempo Total de Contrato (Meses)'] * df_empresa['Valor Contrato Mensal']
#display(df_empresa)

resposta2 = df_empresa[['Codigo do Servico', 'Faturamento Servico']]
display(resposta2)

df_total_faturamento = df_empresa['Faturamento Servico'].sum()
print(f'Total Faturamento: R$ {df_total_faturamento:,.2f}')

    Codigo do Servico  Faturamento Servico
0              OS0001                 7560
1              OS0002                15120
2              OS0003                35280
3              OS0004                28080
4              OS0005                18720
..                ...                  ...
232            OS0233                 6300
233            OS0234                29520
234            OS0235                14310
235            OS0236                58590
236            OS0237                29160

[237 rows x 2 columns]

Total Faturamento: R$ 5,519,160.00

In [114]:
df_func_ajust
df_serviços

df_contratos = df_serviços.merge(df_func_ajust, how='inner', left_on='ID Funcionário', right_on='ID Funcionário')
df_contratos

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses),Estado Civil,Nome Completo,Salario Base,Impostos,Beneficios,VT,VR,Cargo,Area
0,OS0001,67,1,14,C,Carla Amiccuci Areias,12054,6027.0,2410.8,308,"829,92",Coordenador,Financeiro
1,OS0002,17,2,12,S,Pedro Carrera,15718,7859.0,3143.6,176,"628,32",Coordenador,Logística
2,OS0003,116,4,14,C,Bruno Cunha Felippe,21154,10577.0,4230.8,198,"792,96",Analista,Logística
3,OS0004,37,5,8,C,Marcos Almeida Albuquerque Faria,3398,1699.0,679.6,242,"540,96",Analista,Financeiro
4,OS0005,130,6,8,S,Mylena Pinheiro Mariano,5818,2909.0,1163.6,242,"598,08",Coordenador,Comercial
...,...,...,...,...,...,...,...,...,...,...,...,...,...
232,OS0233,111,315,4,S,Daniela Santos Silva,9367,4683.5,1873.4,198,"554,4",Estagiário,Operações
233,OS0234,124,316,8,S,Carolina Gonçalves Lixa Fontoura,12559,6279.5,2511.8,242,"688,8",Analista,Comercial
234,OS0235,72,317,6,S,Lucas Duarte,11867,5933.5,2373.4,264,"524,16",Analista,Logística
235,OS0236,90,319,14,S,Bruna Tavares Vasconcelos,12101,6050.5,2420.2,176,"591,36",Estagiário,Administrativo
236,OS0237,22,320,12,S,Bruno Vargas,10726,5363.0,2145.2,198,"547,68",Gerente,Comercial